

## Зачем ставить цели?

**Что такое?** Sprint Goal - единственная цель работы на cпринт, она создается во время планирования спринта и описывает то, **для чего** создается инкремент продукта. Полное описание можно почитать [*в официальном скрам-гайде.*](https://scrumguides.org/docs/scrumguide/v2020/2020-Scrum-Guide-Russian.pdf)

**Зачем?** Отсутствие четкой цели на спринт может привести к тому, что команда потеряет фокус и не будет знать что важно сделать за спринт. Цель спринта должна отвечать на вопрос - *“Зачем мы работаем над этим спринтом?”*.

**Цель помогает:** 

1. *Держать фокус.* Команда управляет бэклогом, может что-то добавить или удалить для того, чтобы помочь в достижении цели
2. *Обеспечивать связность.* Побуждает команду работать совместно, а не над отдельными инициативами
3. *Понимать ценности*. Почему делаются именно эти задачи, задает единое направление

## Как формулировать цели

Цель сформулирована плохо, если описано только то что делать. Там где нет объяснения - это признак некачественного понимания задачи.

Главный критерий качества понимания задачи: явно названное полезное действие и способ его достижения.

**Кто ставит цель?** Владелец продукта ставит основную задачу спринта или приносит черновик целей на обсуждение. Команда оценивает достижимость и совместно может переформулировать цель спринта.

**Когда**? Цель формируется во время планирования спринта. Если работа не соответствует ожиданиям, они взаимодействуют с владельцем продукта, чтобы пересмотреть содержание бэклога в рамках спринта, но не изменяют цель спринта. 

*Примечание*: Только владелец продукта имеет право в ходе спринта поменять цель или отказаться от нее, если понимает, что это сейчас не в приоритете.

**Какая должна быть цель?** 

- Самая приоритетная задача
- Должна ударять в главную цель (квартальную)
- Сформирована по SMART
- Явно описаны полезные действия и способ его достижения
- Объединяющая усилия команды
- Понятна описана для команды и стейкхолдеров
- Обращена на видение продукта и глобальную цель

**Сколько целей?** Необходимо стараться минимизировать количество целей, чтобы не терять фокус команды на спринт. 2-3 цели за спринт считается оптимальным.

## Шаблоны и примеры

**Когда цель спринта неочевидна:**

- Можно сформулировать вдохновляющую метафорическую цель
- Может быть как цель, которая склеивает все куски из бэклога
- Вытащить решение с ретроспективы
- Валидация гипотез
- Технологическое улучшение

**Шаблоны**: 

1. In the end of the Sprint, a <**Persona**> would be able to <**Activity**> so that <**Business impact**>.
2. Our focus is on <**Outcome**>. We believe it delivers <**Impact**> to <**Customer**>. This will be confirmed when <**Event happens**>.

## Check-List

**Приблизительный чек-лист по постановке:**

- [ ]  Цель спринта понятна всем членам команды и стейкхолдерам
- [ ]  Цель связана с OKR команды
- [ ]  Понятен конечный результат и метрики успеха
- [ ]  Вся команда уверена в его достижении

**Что если не удается достигать цели?**

1. Возможно, это связано с количеством целей, которые не позволяют держать фокус
2. Цели сформулированы не по SMART 
3. Возможно, проблема в оценке и декомпозиции
